public class Main {
    public static void main(String[] args) {
        int ticketPrice = 15_685;
        int milePrice = 20;
        int bonus;

        bonus = ticketPrice / milePrice;
        System.out.println(bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
